/*
Составить программу, содержащую стандартный набор функций обработки строк (аналоги си-функций). 
Программу необходимо реализовать без использования си-функций.
*/


#include "myfunctions.h"





int main() {
	char string[100] = "1234567asd asdasfdfij f[qaewfj0ew ";
	char* ptr = string;
	char string2[] = "||||||";
	//cout<<lengthString(string);
	//cout<<balanceBrackets(string);
	//cout<<occurenceSubstring(string, string2);
	//cout<<lengthString(string);
	//cout<<сutString(string, 3, 8);
}